# Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.

print('Введите количество чисел для заполнения списка: ')
num = int(input())


